In [1]:
import pandas as pd

In [2]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
       'year': [2000, 2001, 2002, 2001, 2002, 2003], 
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [3]:
frame = pd.DataFrame(data)  # initialize using a dictionary

In [4]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [5]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [6]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [7]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

In [8]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [9]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [10]:
type(frame2), type(frame2['state'])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [11]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [12]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [13]:
frame2['debt'] = 16.5  # assigned a scalar value

In [14]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [15]:
frame2['debt'] = range(6)  # assign an array of values

In [16]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [17]:
frame2['eastern'] = frame2.state == 'Ohio'

In [18]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5     0     True
two    2001    Ohio  1.7     1     True
three  2002    Ohio  3.6     2     True
four   2001  Nevada  2.4     3    False
five   2002  Nevada  2.9     4    False
six    2003  Nevada  3.2     5    False

In [19]:
del frame2['eastern']

In [20]:
data = {'Nevada': {2001: 2.4, 2002: 2.9}, 
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [21]:
frame3 = pd.DataFrame(data)   # initalize with a nested dict of dicts

In [22]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [23]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [24]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [25]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [26]:
# index
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [27]:
######

In [28]:
import numpy as np

In [29]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [30]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [31]:
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [32]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [34]:
frame3.drop(columns=['Nevada'])

      Ohio
2000   1.5
2001   1.7
2002   3.6

In [35]:
frame3.drop([2001])

      Nevada  Ohio
2000     NaN   1.5
2002     2.9   3.6

In [36]:
frame3 > 2

      Nevada   Ohio
2000   False  False
2001    True  False
2002    True   True

In [37]:
frame3['Ohio'] > 2

2000    False
2001    False
2002     True
Name: Ohio, dtype: bool

In [38]:
frame3[frame3['Ohio'] > 2]

      Nevada  Ohio
2002     2.9   3.6

In [39]:
### select rows

In [41]:
data = frame3.T

In [42]:
data

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [43]:
data.loc['Nevada']

2000    NaN
2001    2.4
2002    2.9
Name: Nevada, dtype: float64

In [44]:
data.iloc[0]  # select row(s)

2000    NaN
2001    2.4
2002    2.9
Name: Nevada, dtype: float64

In [45]:
data.iloc[:, 1]  # select column(s)

Nevada    2.4
Ohio      1.7
Name: 2001, dtype: float64

In [46]:
### arithmetic operations

In [47]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), 
                  columns=list('bcd'), 
                  index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),
                  columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [48]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [50]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [53]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [56]:
### Function Applying and Mapping

In [58]:
frame = pd.DataFrame(np.random.randn(4, 3),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [61]:
np.abs(frame) # numpy ufuncs work with dataframe

               b         d         e
Utah    1.587111  0.174757  0.359779
Ohio    0.444772  0.044094  0.270792
Texas   0.161063  0.905698  0.235321
Oregon  2.017138  2.250079  0.574815

In [62]:
frame

               b         d         e
Utah    1.587111 -0.174757 -0.359779
Ohio    0.444772 -0.044094 -0.270792
Texas   0.161063 -0.905698  0.235321
Oregon  2.017138  2.250079 -0.574815

In [64]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.856075
d    3.155777
e    0.810136
dtype: float64